## Pandas Tutorial

Pandas is an open source, BSD-licensed library providing high-performance, easy-to-use data structures and data analysis tools for the python programming language.

- what is data frames
- what is data series
- different operation in Pandas

In [1]:
## first step is to import pandas

import pandas as pd 
import numpy as np

In [12]:
## playing with data frames
# 2-d

In [3]:
df = pd.DataFrame(np.arange(0,20).reshape(5,4), index=['Row1', 'Row2', 'Row3', 'Row4', 'Row5'], columns=['Column1','Column2', 'Column3','Column4'])

In [4]:
df

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [14]:
df.to_csv('test1') # inbulti func to csv

In [5]:
df.head(2) # returns 1 and 2nd rows

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7

In [6]:
df.head() # returns 1st five rows

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [15]:
## accessing the elements
# .loc (row index)
# .iloc(bith row and column)

In [8]:
df.loc['Row1']

Column1    0
Column2    1
Column3    2
Column4    3
Name: Row1, dtype: int32

In [9]:
df.loc["Row2"]

Column1    4
Column2    5
Column3    6
Column4    7
Name: Row2, dtype: int32

In [10]:
type(df) # here type of df is data frame

pandas.core.frame.DataFrame

In [11]:
type(df.loc['Row1']) # here type is series

pandas.core.series.Series

 we can conclude here that data frame should contains more than one row and one column

In [16]:
# series can have one row or one column

In [17]:
df.iloc[:,:]

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [18]:
df.iloc[0:2,0:2]

      Column1  Column2
Row1        0        1
Row2        4        5

In [19]:
# in R index starts frim 1
# in Python index starts from 0

In [20]:
type(df.iloc[0:2,0:2])

pandas.core.frame.DataFrame

In [21]:
# convert dataframe into array
df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [22]:
df.isnull().sum()

Column1    0
Column2    0
Column3    0
Column4    0
dtype: int64

In [23]:
df

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [24]:
df['Column1'].unique()

array([ 0,  4,  8, 12, 16])

In [25]:
df['Column1'].count()

5

In [26]:
df[['Column1','Column2']]

      Column1  Column2
Row1        0        1
Row2        4        5
Row3        8        9
Row4       12       13
Row5       16       17

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Row1 to Row5
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Column1  5 non-null      int32
 1   Column2  5 non-null      int32
 2   Column3  5 non-null      int32
 3   Column4  5 non-null      int32
dtypes: int32(4)
memory usage: 280.0+ bytes

In [28]:
df.describe() # remember that categoral feature wont consider

         Column1    Column2    Column3    Column4
count   5.000000   5.000000   5.000000   5.000000
mean    8.000000   9.000000  10.000000  11.000000
std     6.324555   6.324555   6.324555   6.324555
min     0.000000   1.000000   2.000000   3.000000
25%     4.000000   5.000000   6.000000   7.000000
50%     8.000000   9.000000  10.000000  11.000000
75%    12.000000  13.000000  14.000000  15.000000
max    16.000000  17.000000  18.000000  19.000000

In [29]:
df

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [32]:
df['Column1'].value_counts()

12    1
4     1
16    1
8     1
0     1
Name: Column1, dtype: int64

In [36]:
data1 = ('col1','col2','col3\n'
       'x','y','z\n'
       'a','b','c\n'
       '1,2,3\n')

In [37]:
type(data1)

tuple

In [38]:
data = ('col1,col2,col3\n'
       'x,y,1\n'
       'a,b,2\n'
       'c,d,3')

In [39]:
data

'col1,col2,col3\nx,y,1\na,b,2\nc,d,3'

In [40]:
type(data)

str

In [41]:
stringIO()

NameError: name 'StringIO' is not defined

In [43]:
from io import StringIO, BytesIO

In [45]:
StringIO()

In [46]:
pd.read_csv(StringIO(data))

  col1 col2  col3
0    x    y     1
1    a    b     2
2    c    d     3

In [50]:
## read from specific columns
df = pd.read_csv(StringIO(data), usecols=['col2','col3'])
# here we use usecols

In [49]:
df

  col2  col3
0    y     1
1    b     2
2    d     3

In [51]:
df.to_csv('test.csv')

In [52]:
# specifying columns data type

data = ('a,b,c,d\n'
       '1,2,3,4\n'
       '5,6,7,8\n'
       '9,10,11')

In [53]:
data

'a,b,c,d\n1,2,3,4\n5,6,7,8\n9,10,11'

In [54]:
print(data)

a,b,c,d
1,2,3,4
5,6,7,8
9,10,11

In [55]:
df = pd.read_csv(StringIO(data), dtype=object)

In [56]:
df

   a   b   c    d
0  1   2   3    4
1  5   6   7    8
2  9  10  11  NaN

In [57]:
df['c']

0     3
1     7
2    11
Name: c, dtype: object

In [58]:
# here we see that dtype is object, we can change it into int or float or any data type

In [59]:
df['c'][1]

'7'

In [60]:
df = pd.read_csv(StringIO(data), dtype= int)

ValueError: Integer column has NA values in column 3

In [61]:
df

   a   b   c    d
0  1   2   3    4
1  5   6   7    8
2  9  10  11  NaN

In [65]:
data2= ('a,b,c,d\n'
       '1,2,3,4\n'
       '5,6,7,8\n'
       '9,10,11,12')

In [66]:
df = pd.read_csv(StringIO(data2), dtype=int)

In [67]:
df

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [70]:
df = pd.read_csv(StringIO(data2), dtype={'a':'int32','b':int,'c':float})

In [71]:
df

   a   b     c   d
0  1   2   3.0   4
1  5   6   7.0   8
2  9  10  11.0  12

In [72]:
df['a']

0    1
1    5
2    9
Name: a, dtype: int32

In [73]:
df['b']

0     2
1     6
2    10
Name: b, dtype: int32

In [74]:
df['c']

0     3.0
1     7.0
2    11.0
Name: c, dtype: float64

In [75]:
df.dtypes

a      int32
b      int32
c    float64
d      int64
dtype: object

In [92]:
data3 = ('index,a,b,c\n'
            '4,apple,bat,5.7\n'
            '8,orange,cow,10')

In [93]:
pd.read_csv(StringIO(data3))

   index       a    b     c
0      4   apple  bat   5.7
1      8  orange  cow  10.0

In [94]:
# we want to put index col at the 1st column
pd.read_csv(StringIO(data3),index_col=0)

            a    b     c
index
4       apple  bat   5.7
8      orange  cow  10.0

In [88]:
df3 = pd.read_csv(StringIO(data3))

In [89]:
df3

    index    a   b    c
4   apple  bat   5  7.0
8  orange  cow  10  NaN

In [90]:
df3 = pd.read_csv(StringIO(data3),index_col=False)

In [91]:
df3

   index       a    b   c
0      4   apple  bat   5
1      8  orange  cow  10

In [95]:
# another example

In [98]:
data4 = ('a,b,c\n'
        '4,apple,bat,\n'
        '8,orange,cow,')

In [99]:
pd.read_csv(StringIO(data4))

        a    b   c
4   apple  bat NaN
8  orange  cow NaN

In [100]:
# to allign the columns, as we are seeing NaN
pd.read_csv(StringIO(data4), index_col=False)

   a       b    c
0  4   apple  bat
1  8  orange  cow

In [101]:
# combining usecols and index_col
data5 = ('a,b,c\n'
        '4,apple,bat,\n'
        '8,orange,cow,')

In [103]:
pd.read_csv(StringIO(data5))

        a    b   c
4   apple  bat NaN
8  orange  cow NaN

In [105]:
pd.read_csv(StringIO(data5), usecols=['b','c'], index_col=False)

        b    c
0   apple  bat
1  orange  cow

In [106]:
## Quoting and Escape characters, very use in NLP

data6= 'a,b\n "hello, \\"BOB\\", nice to see you",5'

In [107]:
pd.read_csv(StringIO(data6))

                                  a  b
 "hello  \"BOB\"   nice to see you"  5

In [108]:
# to remove the escape characters (\\)\
pd.read_csv(StringIO(data6),escapechar='\\')

                                a  b
 "hello  "BOB"   nice to see you"  5

In [112]:
## URL to CSV

df=pd.read_csv('https://download.bls.gov/pub/time.series/cu/cu.item',
                 sep='\t')

,item_code,item_name,display_level,selectable,sort_sequence
0,AA0,All items - old base,0,T,2
1,AA0R,Purchasing power of the consumer dollar - old ...,0,T,399
2,SA0,All items,0,T,1
3,SA0E,Energy,1,T,374
4,SA0L1,All items less food,1,T,358

In [113]:
# Handling Missing Values

## drop nan values
df = pd.DataFrame(np.random.randn(5,3), index = ['a','c','e','f','h'], columns=['one','two','three'])

In [114]:
df

        one       two     three
a -0.433178 -0.460646  0.656821
c  0.859731 -0.709581  1.802098
e -0.330945  1.339354  0.278489
f -0.714804 -1.658299 -1.279460
h -0.322869 -0.016566  0.815107

In [115]:
df2 = df.reindex(['a','b','c','d','e','f','g','h'])

In [116]:
df2

        one       two     three
a -0.433178 -0.460646  0.656821
b       NaN       NaN       NaN
c  0.859731 -0.709581  1.802098
d       NaN       NaN       NaN
e -0.330945  1.339354  0.278489
f -0.714804 -1.658299 -1.279460
g       NaN       NaN       NaN
h -0.322869 -0.016566  0.815107

In [118]:
df.dropna(axis=1)

        one       two     three
a -0.433178 -0.460646  0.656821
c  0.859731 -0.709581  1.802098
e -0.330945  1.339354  0.278489
f -0.714804 -1.658299 -1.279460
h -0.322869 -0.016566  0.815107

In [119]:
pd.isna(df2['one'])

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool

In [120]:
df2['one'].notna()

a     True
b    False
c     True
d    False
e     True
f     True
g    False
h     True
Name: one, dtype: bool

In [121]:
df2.fillna('Missing')

        one        two     three
a -0.433178  -0.460646  0.656821
b   Missing    Missing   Missing
c  0.859731  -0.709581    1.8021
d   Missing    Missing   Missing
e -0.330945    1.33935  0.278489
f -0.714804    -1.6583  -1.27946
g   Missing    Missing   Missing
h -0.322869 -0.0165659  0.815107